libadmintools/smartschool/V3Binding.saveUser.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
  xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
  xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
  xmlns:xsd="http://www.w3.org/2001/XMLSchema"
  xmlns:ns1="https://sanctamaria-aarschot.smartschool.be/Webservices/V3">
 <SOAP-ENV:Body  SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
  <ns1:saveUser>
   <accesscode></accesscode>
   <internnumber></internnumber>
   <username></username>
   <passwd1></passwd1>
   <passwd2></passwd2>
   <passwd3></passwd3>
   <name></name>
   <surname></surname>
   <extranames></extranames>
   <initials></initials>
   <sex></sex>
   <birthday></birthday>
   <birthplace></birthplace>
   <birthcountry></birthcountry>
   <address></address>
   <postalcode></postalcode>
   <location></location>
   <country></country>
   <email></email>
   <mobilephone></mobilephone>
   <homephone></homephone>
   <fax></fax>
   <prn></prn>
   <stamboeknummer></stamboeknummer>
   <basisrol></basisrol>
   <untis></untis>
  </ns1:saveUser>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
